RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6360/HPM6360_svd.xml
        <register>
          <name>OE_GPIOY_TOGGLE</name>
          <description>GPIO direction toggle</description>
          <addressOffset>0x2ec</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DIRECTION</name>
              <description>GPIO direction, each bit represents a bus bit
0: input
1: output</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OE_GPIOZ_VALUE</name>
          <description>GPIOZ direction</description>
          <addressOffset>0x2f0</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DIRECTION</name>
              <description>GPIO direction, each bit represents a bus bit
0: input
1: output</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OE_GPIOZ_SET</name>
          <description>GPIO direction set</description>
          <addressOffset>0x2f4</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DIRECTION</name>
              <description>GPIO direction, each bit represents a bus bit
0: input
1: output</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OE_GPIOZ_CLEAR</name>
          <description>GPIO direction clear</description>
          <addressOffset>0x2f8</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DIRECTION</name>
              <description>GPIO direction, each bit represents a bus bit
0: input
1: output</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OE_GPIOZ_TOGGLE</name>
          <description>GPIO direction toggle</description>
          <addressOffset>0x2fc</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DIRECTION</name>
              <description>GPIO direction, each bit represents a bus bit
0: input
1: output</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IF_GPIOA_VALUE</name>
          <description>GPIO interrupt flag value</description>
          <addressOffset>0x300</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IRQ_FLAG</name>
              <description>GPIO interrupt flag, write 1 to clear this flag
0: no irq
1: irq pending</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IF_GPIOA_SET</name>
          <description>GPIO interrupt flag set</description>
          <addressOffset>0x304</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IRQ_FLAG</name>
              <description>GPIO interrupt flag, write 1 to clear this flag
0: no irq
1: irq pending</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IF_GPIOA_CLEAR</name>
          <description>GPIO interrupt flag clear</description>
          <addressOffset>0x308</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IRQ_FLAG</name>
              <description>GPIO interrupt flag, write 1 to clear this flag
0: no irq
1: irq pending</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IF_GPIOA_TOGGLE</name>
          <description>GPIO interrupt flag toggle</description>
          <addressOffset>0x30c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IRQ_FLAG</name>
              <description>GPIO interrupt flag, write 1 to clear this flag
0: no irq
1: irq pending</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IF_GPIOB_VALUE</name>
          <description>GPIOB interrupt flag</description>
          <addressOffset>0x310</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IRQ_FLAG</name>
              <description>GPIO interrupt flag, write 1 to clear this flag
0: no irq
1: irq pending</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IF_GPIOB_SET</name>
          <description>GPIO interrupt flag set</description>
          <addressOffset>0x314</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IRQ_FLAG</name>
              <description>GPIO interrupt flag, write 1 to clear this flag
0: no irq
1: irq pending</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IF_GPIOB_CLEAR</name>
          <description>GPIO interrupt flag clear</description>
          <addressOffset>0x318</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IRQ_FLAG</name>
              <description>GPIO interrupt flag, write 1 to clear this flag
0: no irq
1: irq pending</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IF_GPIOB_TOGGLE</name>
          <description>GPIO interrupt flag toggle</description>
          <addressOffset>0x31c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IRQ_FLAG</name>
              <description>GPIO interrupt flag, write 1 to clear this flag
0: no irq
1: irq pending</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IF_GPIOC_VALUE</name>
          <description>GPIOC interrupt flag</description>
          <addressOffset>0x320</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IRQ_FLAG</name>
              <description>GPIO interrupt flag, write 1 to clear this flag
0: no irq
1: irq pending</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IF_GPIOC_SET</name>
          <description>GPIO interrupt flag set</description>
          <addressOffset>0x324</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IRQ_FLAG</name>
              <description>GPIO interrupt flag, write 1 to clear this flag
0: no irq
1: irq pending</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IF_GPIOC_CLEAR</name>
          <description>GPIO interrupt flag clear</description>
          <addressOffset>0x328</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IRQ_FLAG</name>
              <description>GPIO interrupt flag, write 1 to clear this flag
0: no irq
1: irq pending</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IF_GPIOC_TOGGLE</name>
          <description>GPIO interrupt flag toggle</description>
          <addressOffset>0x32c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IRQ_FLAG</name>
              <description>GPIO interrupt flag, write 1 to clear this flag
0: no irq
1: irq pending</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IF_GPIOX_VALUE</name>
          <description>GPIOX interrupt flag</description>
          <addressOffset>0x3d0</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IRQ_FLAG</name>
              <description>GPIO interrupt flag, write 1 to clear this flag
0: no irq
1: irq pending</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IF_GPIOX_SET</name>
          <description>GPIO interrupt flag set</description>
          <addressOffset>0x3d4</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IRQ_FLAG</name>
              <description>GPIO interrupt flag, write 1 to clear this flag
0: no irq
1: irq pending</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IF_GPIOX_CLEAR</name>
          <description>GPIO interrupt flag clear</description>
          <addressOffset>0x3d8</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IRQ_FLAG</name>
              <description>GPIO interrupt flag, write 1 to clear this flag
0: no irq
1: irq pending</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IF_GPIOX_TOGGLE</name>
          <description>GPIO interrupt flag toggle</description>
          <addressOffset>0x3dc</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IRQ_FLAG</name>
              <description>GPIO interrupt flag, write 1 to clear this flag
0: no irq
1: irq pending</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IF_GPIOY_VALUE</name>
          <description>GPIOY interrupt flag</description>
          <addressOffset>0x3e0</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IRQ_FLAG</name>
              <description>GPIO interrupt flag, write 1 to clear this flag
0: no irq
1: irq pending</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IF_GPIOY_SET</name>
          <description>GPIO interrupt flag set</description>
          <addressOffset>0x3e4</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IRQ_FLAG</name>
              <description>GPIO interrupt flag, write 1 to clear this flag
0: no irq
1: irq pending</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IF_GPIOY_CLEAR</name>
          <description>GPIO interrupt flag clear</description>
          <addressOffset>0x3e8</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IRQ_FLAG</name>
              <description>GPIO interrupt flag, write 1 to clear this flag
0: no irq
1: irq pending</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IF_GPIOY_TOGGLE</name>
          <description>GPIO interrupt flag toggle</description>
          <addressOffset>0x3ec</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IRQ_FLAG</name>
              <description>GPIO interrupt flag, write 1 to clear this flag
0: no irq
1: irq pending</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IF_GPIOZ_VALUE</name>
          <description>GPIOZ interrupt flag</description>
          <addressOffset>0x3f0</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IRQ_FLAG</name>
              <description>GPIO interrupt flag, write 1 to clear this flag
0: no irq
1: irq pending</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IF_GPIOZ_SET</name>
          <description>GPIO interrupt flag set</description>
          <addressOffset>0x3f4</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IRQ_FLAG</name>
              <description>GPIO interrupt flag, write 1 to clear this flag
0: no irq
1: irq pending</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IF_GPIOZ_CLEAR</name>
          <description>GPIO interrupt flag clear</description>
          <addressOffset>0x3f8</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IRQ_FLAG</name>
              <description>GPIO interrupt flag, write 1 to clear this flag
0: no irq
1: irq pending</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IF_GPIOZ_TOGGLE</name>
          <description>GPIO interrupt flag toggle</description>
          <addressOffset>0x3fc</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IRQ_FLAG</name>
              <description>GPIO interrupt flag, write 1 to clear this flag
0: no irq
1: irq pending</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IE_GPIOA_VALUE</name>
          <description>GPIO interrupt enable value</description>
          <addressOffset>0x400</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IRQ_EN</name>
              <description>GPIO interrupt enable, each bit represents a bus bit
0: irq is disabled
1: irq is enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IE_GPIOA_SET</name>
          <description>GPIO interrupt enable set</description>
          <addressOffset>0x404</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IRQ_EN</name>
              <description>GPIO interrupt enable, each bit represents a bus bit
0: irq is disabled
1: irq is enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IE_GPIOA_CLEAR</name>
          <description>GPIO interrupt enable clear</description>
          <addressOffset>0x408</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IRQ_EN</name>
              <description>GPIO interrupt enable, each bit represents a bus bit
0: irq is disabled
1: irq is enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IE_GPIOA_TOGGLE</name>
          <description>GPIO interrupt enable toggle</description>
          <addressOffset>0x40c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IRQ_EN</name>
              <description>GPIO interrupt enable, each bit represents a bus bit
0: irq is disabled
1: irq is enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IE_GPIOB_VALUE</name>
          <description>GPIOB interrupt enable</description>
          <addressOffset>0x410</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IRQ_EN</name>
              <description>GPIO interrupt enable, each bit represents a bus bit
0: irq is disabled
1: irq is enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IE_GPIOB_SET</name>
          <description>GPIO interrupt enable set</description>
          <addressOffset>0x414</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IRQ_EN</name>
              <description>GPIO interrupt enable, each bit represents a bus bit
0: irq is disabled
1: irq is enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IE_GPIOB_CLEAR</name>
          <description>GPIO interrupt enable clear</description>
          <addressOffset>0x418</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IRQ_EN</name>
              <description>GPIO interrupt enable, each bit represents a bus bit
0: irq is disabled
1: irq is enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
