RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6360/HPM6360_svd.xml
        <register>
          <name>ASSIGN_GPIOZ_PIN_PIN07</name>
          <description>GPIO mananger</description>
          <addressOffset>0x79c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x80000301</resetMask>
          <fields>
            <field>
              <name>LOCK</name>
              <description>lock fields in this register, lock can only be cleared by soc reset
0: fields can be changed
1: fields locked to current value, not changeable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HIDE</name>
              <description>pin value visibility to gpios,
bit0: 1, invisible to soc gpio0; 0: visible to soc gpio0
bit1: 1, invisible to cpu0 fast gpio; 0: visible to cpu0 fast gpio</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SELECT</name>
              <description>select which gpio controls chip pin,
0: soc gpio0;
1: cpu0 fastgpio</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ASSIGN_GPIOZ_PIN_PIN08</name>
          <description>GPIO mananger</description>
          <addressOffset>0x7a0</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x80000301</resetMask>
          <fields>
            <field>
              <name>LOCK</name>
              <description>lock fields in this register, lock can only be cleared by soc reset
0: fields can be changed
1: fields locked to current value, not changeable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HIDE</name>
              <description>pin value visibility to gpios,
bit0: 1, invisible to soc gpio0; 0: visible to soc gpio0
bit1: 1, invisible to cpu0 fast gpio; 0: visible to cpu0 fast gpio</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SELECT</name>
              <description>select which gpio controls chip pin,
0: soc gpio0;
1: cpu0 fastgpio</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ASSIGN_GPIOZ_PIN_PIN09</name>
          <description>GPIO mananger</description>
          <addressOffset>0x7a4</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x80000301</resetMask>
          <fields>
            <field>
              <name>LOCK</name>
              <description>lock fields in this register, lock can only be cleared by soc reset
0: fields can be changed
1: fields locked to current value, not changeable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HIDE</name>
              <description>pin value visibility to gpios,
bit0: 1, invisible to soc gpio0; 0: visible to soc gpio0
bit1: 1, invisible to cpu0 fast gpio; 0: visible to cpu0 fast gpio</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SELECT</name>
              <description>select which gpio controls chip pin,
0: soc gpio0;
1: cpu0 fastgpio</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ASSIGN_GPIOZ_PIN_PIN10</name>
          <description>GPIO mananger</description>
          <addressOffset>0x7a8</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x80000301</resetMask>
          <fields>
            <field>
              <name>LOCK</name>
              <description>lock fields in this register, lock can only be cleared by soc reset
0: fields can be changed
1: fields locked to current value, not changeable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HIDE</name>
              <description>pin value visibility to gpios,
bit0: 1, invisible to soc gpio0; 0: visible to soc gpio0
bit1: 1, invisible to cpu0 fast gpio; 0: visible to cpu0 fast gpio</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SELECT</name>
              <description>select which gpio controls chip pin,
0: soc gpio0;
1: cpu0 fastgpio</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ASSIGN_GPIOZ_PIN_PIN11</name>
          <description>GPIO mananger</description>
          <addressOffset>0x7ac</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x80000301</resetMask>
          <fields>
            <field>
              <name>LOCK</name>
              <description>lock fields in this register, lock can only be cleared by soc reset
0: fields can be changed
1: fields locked to current value, not changeable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HIDE</name>
              <description>pin value visibility to gpios,
bit0: 1, invisible to soc gpio0; 0: visible to soc gpio0
bit1: 1, invisible to cpu0 fast gpio; 0: visible to cpu0 fast gpio</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SELECT</name>
              <description>select which gpio controls chip pin,
0: soc gpio0;
1: cpu0 fastgpio</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ASSIGN_GPIOZ_PIN_PIN12</name>
          <description>GPIO mananger</description>
          <addressOffset>0x7b0</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x80000301</resetMask>
          <fields>
            <field>
              <name>LOCK</name>
              <description>lock fields in this register, lock can only be cleared by soc reset
0: fields can be changed
1: fields locked to current value, not changeable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HIDE</name>
              <description>pin value visibility to gpios,
bit0: 1, invisible to soc gpio0; 0: visible to soc gpio0
bit1: 1, invisible to cpu0 fast gpio; 0: visible to cpu0 fast gpio</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SELECT</name>
              <description>select which gpio controls chip pin,
0: soc gpio0;
1: cpu0 fastgpio</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ASSIGN_GPIOZ_PIN_PIN13</name>
          <description>GPIO mananger</description>
          <addressOffset>0x7b4</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x80000301</resetMask>
          <fields>
            <field>
              <name>LOCK</name>
              <description>lock fields in this register, lock can only be cleared by soc reset
0: fields can be changed
1: fields locked to current value, not changeable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HIDE</name>
              <description>pin value visibility to gpios,
bit0: 1, invisible to soc gpio0; 0: visible to soc gpio0
bit1: 1, invisible to cpu0 fast gpio; 0: visible to cpu0 fast gpio</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SELECT</name>
              <description>select which gpio controls chip pin,
0: soc gpio0;
1: cpu0 fastgpio</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ASSIGN_GPIOZ_PIN_PIN14</name>
          <description>GPIO mananger</description>
          <addressOffset>0x7b8</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x80000301</resetMask>
          <fields>
            <field>
              <name>LOCK</name>
              <description>lock fields in this register, lock can only be cleared by soc reset
0: fields can be changed
1: fields locked to current value, not changeable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HIDE</name>
              <description>pin value visibility to gpios,
bit0: 1, invisible to soc gpio0; 0: visible to soc gpio0
bit1: 1, invisible to cpu0 fast gpio; 0: visible to cpu0 fast gpio</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SELECT</name>
              <description>select which gpio controls chip pin,
0: soc gpio0;
1: cpu0 fastgpio</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ASSIGN_GPIOZ_PIN_PIN15</name>
          <description>GPIO mananger</description>
          <addressOffset>0x7bc</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x80000301</resetMask>
          <fields>
            <field>
              <name>LOCK</name>
              <description>lock fields in this register, lock can only be cleared by soc reset
0: fields can be changed
1: fields locked to current value, not changeable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HIDE</name>
              <description>pin value visibility to gpios,
bit0: 1, invisible to soc gpio0; 0: visible to soc gpio0
bit1: 1, invisible to cpu0 fast gpio; 0: visible to cpu0 fast gpio</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SELECT</name>
              <description>select which gpio controls chip pin,
0: soc gpio0;
1: cpu0 fastgpio</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ASSIGN_GPIOZ_PIN_PIN16</name>
          <description>GPIO mananger</description>
          <addressOffset>0x7c0</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x80000301</resetMask>
          <fields>
            <field>
              <name>LOCK</name>
              <description>lock fields in this register, lock can only be cleared by soc reset
0: fields can be changed
1: fields locked to current value, not changeable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HIDE</name>
              <description>pin value visibility to gpios,
bit0: 1, invisible to soc gpio0; 0: visible to soc gpio0
bit1: 1, invisible to cpu0 fast gpio; 0: visible to cpu0 fast gpio</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SELECT</name>
              <description>select which gpio controls chip pin,
0: soc gpio0;
1: cpu0 fastgpio</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ASSIGN_GPIOZ_PIN_PIN17</name>
          <description>GPIO mananger</description>
          <addressOffset>0x7c4</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x80000301</resetMask>
          <fields>
            <field>
              <name>LOCK</name>
              <description>lock fields in this register, lock can only be cleared by soc reset
0: fields can be changed
1: fields locked to current value, not changeable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HIDE</name>
              <description>pin value visibility to gpios,
bit0: 1, invisible to soc gpio0; 0: visible to soc gpio0
bit1: 1, invisible to cpu0 fast gpio; 0: visible to cpu0 fast gpio</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SELECT</name>
              <description>select which gpio controls chip pin,
0: soc gpio0;
1: cpu0 fastgpio</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ASSIGN_GPIOZ_PIN_PIN18</name>
          <description>GPIO mananger</description>
          <addressOffset>0x7c8</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x80000301</resetMask>
          <fields>
            <field>
              <name>LOCK</name>
              <description>lock fields in this register, lock can only be cleared by soc reset
0: fields can be changed
1: fields locked to current value, not changeable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HIDE</name>
              <description>pin value visibility to gpios,
bit0: 1, invisible to soc gpio0; 0: visible to soc gpio0
bit1: 1, invisible to cpu0 fast gpio; 0: visible to cpu0 fast gpio</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SELECT</name>
              <description>select which gpio controls chip pin,
0: soc gpio0;
1: cpu0 fastgpio</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ASSIGN_GPIOZ_PIN_PIN19</name>
          <description>GPIO mananger</description>
          <addressOffset>0x7cc</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x80000301</resetMask>
          <fields>
            <field>
              <name>LOCK</name>
              <description>lock fields in this register, lock can only be cleared by soc reset
0: fields can be changed
1: fields locked to current value, not changeable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HIDE</name>
              <description>pin value visibility to gpios,
bit0: 1, invisible to soc gpio0; 0: visible to soc gpio0
bit1: 1, invisible to cpu0 fast gpio; 0: visible to cpu0 fast gpio</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SELECT</name>
              <description>select which gpio controls chip pin,
0: soc gpio0;
1: cpu0 fastgpio</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ASSIGN_GPIOZ_PIN_PIN20</name>
          <description>GPIO mananger</description>
          <addressOffset>0x7d0</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x80000301</resetMask>
          <fields>
            <field>
              <name>LOCK</name>
              <description>lock fields in this register, lock can only be cleared by soc reset
0: fields can be changed
1: fields locked to current value, not changeable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HIDE</name>
              <description>pin value visibility to gpios,
bit0: 1, invisible to soc gpio0; 0: visible to soc gpio0
bit1: 1, invisible to cpu0 fast gpio; 0: visible to cpu0 fast gpio</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SELECT</name>
              <description>select which gpio controls chip pin,
0: soc gpio0;
1: cpu0 fastgpio</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ASSIGN_GPIOZ_PIN_PIN21</name>
          <description>GPIO mananger</description>
          <addressOffset>0x7d4</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x80000301</resetMask>
          <fields>
            <field>
              <name>LOCK</name>
              <description>lock fields in this register, lock can only be cleared by soc reset
0: fields can be changed
1: fields locked to current value, not changeable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HIDE</name>
              <description>pin value visibility to gpios,
bit0: 1, invisible to soc gpio0; 0: visible to soc gpio0
bit1: 1, invisible to cpu0 fast gpio; 0: visible to cpu0 fast gpio</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SELECT</name>
              <description>select which gpio controls chip pin,
0: soc gpio0;
1: cpu0 fastgpio</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ASSIGN_GPIOZ_PIN_PIN22</name>
          <description>GPIO mananger</description>
          <addressOffset>0x7d8</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x80000301</resetMask>
          <fields>
            <field>
              <name>LOCK</name>
              <description>lock fields in this register, lock can only be cleared by soc reset
0: fields can be changed
1: fields locked to current value, not changeable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HIDE</name>
              <description>pin value visibility to gpios,
bit0: 1, invisible to soc gpio0; 0: visible to soc gpio0
bit1: 1, invisible to cpu0 fast gpio; 0: visible to cpu0 fast gpio</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SELECT</name>
              <description>select which gpio controls chip pin,
0: soc gpio0;
1: cpu0 fastgpio</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ASSIGN_GPIOZ_PIN_PIN23</name>
          <description>GPIO mananger</description>
          <addressOffset>0x7dc</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x80000301</resetMask>
          <fields>
            <field>
              <name>LOCK</name>
              <description>lock fields in this register, lock can only be cleared by soc reset
0: fields can be changed
1: fields locked to current value, not changeable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HIDE</name>
              <description>pin value visibility to gpios,
bit0: 1, invisible to soc gpio0; 0: visible to soc gpio0
bit1: 1, invisible to cpu0 fast gpio; 0: visible to cpu0 fast gpio</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SELECT</name>
              <description>select which gpio controls chip pin,
0: soc gpio0;
1: cpu0 fastgpio</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
