RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6360/HPM6360_svd.xml
        <register>
          <name>RTIF</name>
          <description>Receive and Transmit Interrupt Flag Register RTIF (0xa5)</description>
          <addressOffset>0xa5</addressOffset>
          <size>8</size>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>RIF</name>
              <description>Receive Interrupt Flag
1 - Data or a remote frame has been received and is available in the receive buffer.
0 - No frame has been received.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ROIF</name>
              <description>RB Overrun Interrupt Flag
1 - At least one received message has been overwritten in the RB.
0 - No RB overwritten.
In case of an overrun both ROIF and RFIF will be set.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RFIF</name>
              <description>RB Full Interrupt Flag
1 - All RBs are full. If no RB will be released until the next valid message is received,
the oldest message will be lost.
0 - The RB FIFO is not full.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RAFIF</name>
              <description>RB Almost Full Interrupt Flag
1 - number of filled RB slots &gt;= AFWL_i
0 - number of filled RB slots &lt; AFWL_i</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TPIF</name>
              <description>Transmission Primary Interrupt Flag
1 - The requested transmission of the PTB has been successfully completed.
0 - No transmission of the PTB has been completed.
In TTCAN mode, TPIF will never be set. Then only TSIF is valid.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSIF</name>
              <description>Transmission Secondary Interrupt Flag
1 - The requested transmission of the STB has been successfully completed.
0 - No transmission of the STB has been completed successfully.
In TTCAN mode TSIF will signal all successful transmissions, regardless of storage location of
the message.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EIF</name>
              <description>Error Interrupt Flag
1 - The border of the error warning limit has been crossed in either direction,
or the BUSOFF bit has been changed in either direction.
0 - There has been no change.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AIF</name>
              <description>Abort Interrupt Flag
1 - After setting TPA or TSA the appropriated message(s) have been aborted.
It is recommended to not set both TPA and TSA simultaneously because both
source AIF.
0 - No abort has been executed.
The AIF does not have an associated enable register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ERRINT</name>
          <description>ERRor INTerrupt Enable and Flag Register ERRINT</description>
          <addressOffset>0xa6</addressOffset>
          <size>8</size>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>EWARN</name>
              <description>Error WARNing limit reached
1 - One of the error counters RECNT or TECNT is equal or bigger than EWL0 - The values in both counters are less than EWL.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EPASS</name>
              <description>Error Passive mode active
0 - not active (node is error active)
1 - active (node is error passive)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EPIE</name>
              <description>Error Passive Interrupt Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EPIF</name>
              <description>Error Passive Interrupt Flag. EPIF will be activated if the error status changes from error
active to error passive or vice versa and if this interrupt is enabled.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ALIE</name>
              <description>Arbitration Lost Interrupt Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ALIF</name>
              <description>Arbitration Lost Interrupt Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BEIE</name>
              <description>Bus Error Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BEIF</name>
              <description>Bus Error Interrupt Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LIMIT</name>
          <description>Warning Limits Register LIMIT</description>
          <addressOffset>0xa7</addressOffset>
          <size>8</size>
          <resetValue>0x1B</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>AFWL</name>
              <description>receive buffer Almost Full Warning Limit
AFWL defines the internal warning limit AFWL_i with being the number of availableRB slots.
AFWL_i is compared to the number of filled RB slots and triggers RAFIF if equal. Thevalid range of .
AFWL = 0 is meaningless and automatically treated as 0x1. (Note that AFWL is meant in this rule and not AFWL_i.)
AFWL_i &gt; nRB is meaningless and automatically treated as nRB.
AFWL_i = nRB is a valid value, but note that RFIF also exists.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EWL</name>
              <description>Programmable Error Warning Limit = (EWL+1)*8. Possible Limit values: 8, 16, … 128.
The value of EWL controls EIF.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>S_PRESC</name>
          <description>Bit Timing Register(Slow Speed)</description>
          <addressOffset>0xa8</addressOffset>
          <size>32</size>
          <resetValue>0x01020203</resetValue>
          <resetMask>0xFF7F7FFF</resetMask>
          <fields>
            <field>
              <name>S_PRESC</name>
              <description>Prescaler (slow speed)
The prescaler divides the system clock to get the time quanta clock tq_clk.Valid range PRESC=[0x00, 0xff] results in divider values 1 to 256.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>S_SJW</name>
              <description>Synchronization Jump Width (slow speed)
The Synchronization Jump Width is the maximum time forshortening or lengthening the Bit Time for resynchronization, where TQ is a timequanta.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>S_SEG_2</name>
              <description>Bit Timing Segment 2 (slow speed)
Time after the sample point.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>S_SEG_1</name>
              <description>Bit Timing Segment 1 (slow speed)
The sample point will be set to after start of bit time.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>F_PRESC</name>
          <description>Bit Timing Register(Fast Speed)</description>
          <addressOffset>0xac</addressOffset>
          <size>32</size>
          <resetValue>0x01020203</resetValue>
          <resetMask>0xFF0F0F0F</resetMask>
          <fields>
            <field>
              <name>F_PRESC</name>
              <description>Prescaler (fast speed)
The prescaler divides the system clock to get the time quanta clock tq_clk.Valid range PRESC=[0x00, 0xff] results in divider values 1 to 256.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>F_SJW</name>
              <description>Synchronization Jump Width (fast speed)
The Synchronization Jump Width is the maximum time forshortening or lengthening the Bit Time for resynchronization, where TQ is a timequanta.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>F_SEG_2</name>
              <description>Bit Timing Segment 2 (fast speed)
Time after the sample point</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>F_SEG_1</name>
              <description>Bit Timing Segment 1 (fast speed)
The sample point will be set to after start of bit time.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EALCAP</name>
          <description>Error and Arbitration Lost Capture Register EALCAP</description>
          <addressOffset>0xb0</addressOffset>
          <size>8</size>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>KOER</name>
              <description>Kind Of ERror (Error code)
000 - no error
001 - BIT ERROR
010 - FORM ERROR
011 - STUFF ERROR
100 - ACKNOWLEDGEMENT ERROR
101 - CRC ERROR
110 - OTHER ERROR(dominant bits after own error flag, received active Error Flag too long,dominant bit during Passive-Error-Flag after ACK error)
111 - not used
KOER is updated with each new error. Therefore it stays untouched when frames aresuccessfully transmitted or received.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ALC</name>
              <description>Arbitration Lost Capture (bit position in the frame where the arbitration has been lost)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TDC</name>
          <description>Transmitter Delay Compensation Register TDC</description>
          <addressOffset>0xb1</addressOffset>
          <size>8</size>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>TDCEN</name>
              <description>Transmitter Delay Compensation ENable
TDC will be activated during the data phase of a CAN FD frame if BRS is active if TDCEN=1.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SSPOFF</name>
              <description>Secondary Sample Point OFFset
The transmitter delay plus SSPOFF defines the time of the secondary sample point for TDC.
SSPOFF is given as a number of TQ.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RECNT</name>
          <description>Error Counter Registers RECNT</description>
          <addressOffset>0xb2</addressOffset>
          <size>8</size>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>RECNT</name>
              <description>Receive Error CouNT (number of errors during reception)
RECNT is incremented and decremented as defined in the CAN specification.
RECNT does not overflow.
If TXB=1, then the error counters are frozen.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TECNT</name>
          <description>Error Counter Registers TECNT</description>
          <addressOffset>0xb3</addressOffset>
          <size>8</size>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>TECNT</name>
              <description>Transmit Error CouNT (number of errors during transmission)
TECNT is incremented and decremented as defined in the CAN specification.
In case of the “bus off state” TECNT may overflow.
If TXB=1, then the error counters are frozen.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ACFCTRL</name>
          <description>Acceptance Filter Control Register ACFCTRL</description>
          <addressOffset>0xb4</addressOffset>
          <size>8</size>
          <resetValue>0x00</resetValue>
          <resetMask>0x2F</resetMask>
          <fields>
            <field>
              <name>SELMASK</name>
              <description>SELect acceptance MASK
0 - Registers ACF_x point to acceptance code
1 - Registers ACF_x point to acceptance mask.
ACFADR selects one specific acceptance filter.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACFADR</name>
              <description>acceptance filter address
ACFADR points to a specific acceptance filter.
The selected filter is accessible using theregisters ACF_x.
Bit SELMASK selects between acceptance code and mask for theselected acceptance filter.
A value of ACFADR&gt;ACF_NUMBER-1 is meaningless and automatically treated as value ACF_NUMBER-1.
ACF_NUMBER = 16.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMECFG</name>
          <description>CiA 603 Time-Stamping TIMECFG</description>
          <addressOffset>0xb5</addressOffset>
          <size>8</size>
          <resetValue>0x00</resetValue>
          <resetMask>0x03</resetMask>
          <fields>
            <field>
              <name>TIMEPOS</name>
              <description>TIME-stamping POSition
0 – SOF1 – EOF (see Chapter 7)TIMEPOS can only be changed if TIMEEN=0, but it is possible to modify TIMPOS withthe same write access that sets TIMEEN=1.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMEEN</name>
              <description>TIME-stamping ENable
0 – disabled
1 – enabled</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ACF_EN</name>
          <description>Acceptance Filter Enable ACF_EN</description>
          <addressOffset>0xb6</addressOffset>
          <size>16</size>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ACF_EN</name>
              <description>Acceptance filter Enable
1 - acceptance filter enabled
0 - acceptance filter disable
Each acceptance filter (AMASK / ACODE) can be individually enabled or disabled.
Disabled filters reject a message. Only enabled filters can accept a message if the
appropriate AMASK / ACODE configuration matches.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ACF</name>
          <description>Acceptance CODE ACODE or ACMASK</description>
          <addressOffset>0xb8</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7FFFFFFF</resetMask>
          <fields>
            <field>
              <name>AIDEE</name>
              <description>Acceptance mask IDE bit check enable
1 - acceptance filter accepts either standard or extended as defined by AIDE
0 - acceptance filter accepts both standard or extended frames
Only filter 0 is affected by the power-on reset. All other filters stay uninitialized.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AIDE</name>
              <description>Acceptance mask IDE bit value
If AIDEE=1 then:
1 - acceptance filter accepts only extended frames
0 - acceptance filter accepts only standard frames
Only filter 0 is affected by the power-on reset. All other filters stay uninitialized.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CODE_MASK</name>
              <description>Acceptance CODE
1 - ACC bit value to compare with ID bit of the received message
0 - ACC bit value to compare with ID bit of the received message
ACODE_x(10:0) will be used for extended frames.
ACODE_x(28:0) will be used for extended frames.
Only filter 0 is affected by the power-on reset.
Acceptance MASK(if SELMASK ==1 )
1 - acceptance check for these bits of receive identifier disabled
0 - acceptance check for these bits of receive identifier enable
AMASK_x(10:0) will be used for extended frames.
AMASK_x(28:0) will be used for extended frames.
Disabled bits result in accepting the message. Therefore the default configuration after
reset for filter 0 accepts all messages.
Only filter 0 is affected by the power-on reset.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>29</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VER</name>
          <description>Version Information VER</description>
          <addressOffset>0xbc</addressOffset>
          <size>16</size>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>VERSION</name>
              <description>Version of CAN-CTRL, given as decimal value. VER_1 holds the major version and
VER_0 the minor version.Example: version 5x16N00S00 is represented by VER_1=5 and VER_0=16</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TBSLOT</name>
          <description>TTCAN: TB Slot Pointer TBSLOT</description>
          <addressOffset>0xbe</addressOffset>
          <size>8</size>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>TBE</name>
              <description>set TB slot to “Empty”
1 - slot selected by TBPTR shall be marked as “empty”
0 - no actionTBE is automatically reset to 0 as soon as the slot is marked as empty and TSFF=0.
If atransmission from this slot is active, then TBE stays set as long as either the transmission completes or after a transmission error or arbitration loss the
 transmissionis not active any more.
If both TBF and TBE are set, then TBE wins</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TBF</name>
              <description>set TB slot to “Filled”
1 - slot selected by TBPTR shall be marked as “filled”
0 - no actionTBF is automatically reset to 0 as soon as the slot is marked as filled and TSFF=1.
If both TBF and TBE are set, then TBE wins.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TBPTR</name>
              <description>Pointer to a TB message slot.
0x00 - Pointer to the PTB
others - Pointer to a slot in the STB
The message slot pointed to by TBPTR is readable / writable using the TBUF registers.
Write access is only possible if TSFF=0.
Setting TBF to 1 marks the selected slot asfilled and setting TBE to 1 marks the selected slot as empty.
TBSEL and TSNEXT are unused in TTCAN mode and have no meaning.
TBPTR can only point to buffer slots, that exist in the hardware.
Unusable bits ofTBPTR are fixed to 0.
TBPTR is limited to the PTB and 63 STB slots.
 More slots cannot be used in TTCANmode.If TBPTR is too big and points to a slot that is not available, then TBF and TBE arereset automatically and no action takes place.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
