RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6360/HPM6360_svd.xml
        <register>
          <name>TTCFG</name>
          <description>TTCAN: Time Trigger Configuration TTCFG</description>
          <addressOffset>0xbf</addressOffset>
          <size>8</size>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>WTIE</name>
              <description>Watch Trigger Interrupt Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WTIF</name>
              <description>Watch Trigger Interrupt Flag
WTIF will be set if the cycle count reaches the limited defined by TT_WTRIG and WTIE is set.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEIF</name>
              <description>Trigger Error Interrupt Flag
The conditions when TEIF will be set, are defined in Chapter 6.4. There is no bit toenable or disable the handling of TEIF</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TTIE</name>
              <description>Time Trigger Interrupt Enable
If TTIE is set, then TTIF will be set if the cycle time is equal to the trigger timeTT_TRIG.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TTIF</name>
              <description>Time Trigger Interrupt Flag
TTIF will be set if TTIE is set and the cycle time is equal to the trigger time TT_TRIG.
Writing an one to TTIF resets it. Writing a zero has no impact.TTIF will be set only once.
If TT_TRIG gets not updated, then TTIF will be not setagain in the next basic cycle.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>T_PRESC</name>
              <description>TTCAN Timer PRESCaler
00b - 1
01b - 2
10b - 4
11b - 8
The TTCAN time base is a CAN bittime defined by S_PRES, S_SEG_1 and S_SEG_2.With T_PRESC an additional prescaling factor of 1, 2, 4 or 8 is defined.
T_PRESC can only be modified if TTEN=0, but it is possible to modify T_PRESC and setTTEN simultaneously with one write access.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TTEN</name>
              <description>Time Trigger Enable
1 - TTCAN enabled, timer is running0 - disabled</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REF_MSG</name>
          <description>TTCAN: Reference Message REF_MSG</description>
          <addressOffset>0xc0</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x9FFFFFFF</resetMask>
          <fields>
            <field>
              <name>REF_IDE</name>
              <description>REFerence message IDE bit.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REF_MSG</name>
              <description>REFerence message IDentifier.
If REF_IDE is
1 - REF_ID(28:0) is valid (extended ID)
0 - REF_ID(10:0) is valid (standard ID)
REF_ID is used in TTCAN mode to detect a reference message. This holds for time
slaves (reception) as well as for the time master (transmission). If the reference
message is detected and there are no errors, then the Sync_Mark of this frame will
become the Ref_Mark.
REF_ID(2:0) is not tested and therefore the appropriate register bits are forced to 0.
These bits are used for up to 8 potential time masters.
CAN-CTRL recognizes the reference message only by ID. The payload is not tested.
Additional note: A time master will transmit a reference message in the same way as a
normal frame. REF_ID is intended for detection of a successful transmission of a
reference message.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>29</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRIG_CFG</name>
          <description>TTCAN: Trigger Configuration TRIG_CFG</description>
          <addressOffset>0xc4</addressOffset>
          <size>16</size>
          <resetValue>0x0000</resetValue>
          <resetMask>0xF73F</resetMask>
          <fields>
            <field>
              <name>TEW</name>
              <description>Transmit Enable Window
For a single shot transmit trigger there is a time of up to 16 ticks of the cycle time
where the frame is allowed to start. TWE+1 defines the number of ticks.
TEW=0 is a valid setting and shortens the transmit enable window to 1 tick</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TTYPE</name>
              <description>Trigger Type
000b - Immediate Trigger for immediate transmission
001b - Time Trigger for receive triggers
010b - Single Shot Transmit Trigger for exclusive time windows
011b - Transmit Start Trigger for merged arbitrating time windows
100b - Transmit Stop Trigger for merged arbitrating time windows
others - no action
The time of the trigger is defined by TT_TRIG. TTPTR selects the TB slot for the
transmit triggers. See Chapter 6.4 for more details.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TTPTR</name>
              <description>Transmit Trigger TB slot Pointer
If TTPTR is too big and points to a slot that is not available, then TEIF is set and no
new trigger can be activated after a write access to TT_TRIG_1.
If TTPTR points to an empty slot, then TEIF will be set at the moment, when the
trigger time is reached.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TT_TRIG</name>
          <description>TTCAN: Trigger Time TT_TRIG</description>
          <addressOffset>0xc6</addressOffset>
          <size>16</size>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>TT_TRIG</name>
              <description>Trigger Time
TT_TRIG(15:0) defines the cycle time for a trigger.
For a transmission trigger theearliest point of transmission of the SOF of the appropriate frame will be TT_TRIG+1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TT_WTRIG</name>
          <description>TTCAN: Watch Trigger Time TT_WTRIG</description>
          <addressOffset>0xc8</addressOffset>
          <size>16</size>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>TT_WTRIG</name>
              <description>Watch Trigger Time
TT_WTRIG(15:0) defines the cycle time for a watch trigger. The initial watch trigger isthe maximum cycle time 0xffff.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
