RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6360/HPM6360_svd.xml
        <register>
          <name>SR</name>
          <description>Status register</description>
          <addressOffset>0x220</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0FFFFFFF</resetMask>
          <fields>
            <field>
              <name>FAULTF</name>
              <description>fault condition flag</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XRLDF</name>
              <description>extended reload flag, this flag set when xcnt count to xrld value or when SYNCI assert</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HALFRLDF</name>
              <description>half reload flag, this flag set when cnt count to rld/2</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RLDF</name>
              <description>reload flag, this flag set when cnt count to rld value or when SYNCI assert</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPFX</name>
              <description>comparator output compare or input capture flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQEN</name>
          <description>Interrupt request enable register</description>
          <addressOffset>0x224</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0FFFFFFF</resetMask>
          <fields>
            <field>
              <name>FAULTIRQE</name>
              <description>fault condition interrupt enable</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XRLDIRQE</name>
              <description>extended reload flag interrupt enable</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HALFRLDIRQE</name>
              <description>half reload flag interrupt enable</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RLDIRQE</name>
              <description>reload flag interrupt enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPIRQEX</name>
              <description>comparator output compare or input capture flag interrupt enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAEN</name>
          <description>DMA request enable register</description>
          <addressOffset>0x22c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0FFFFFFF</resetMask>
          <fields>
            <field>
              <name>FAULTEN</name>
              <description>fault condition DMA request enable</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XRLDEN</name>
              <description>extended reload flag DMA request enable</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HALFRLDEN</name>
              <description>half reload flag DMA request enable</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RLDEN</name>
              <description>reload flag DMA request enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPENX</name>
              <description>comparator output compare or input capture flag DMA request enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMPCFG_CMPCFG0</name>
          <description>Comparator configure register</description>
          <addressOffset>0x230</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>XCNTCMPEN</name>
              <description>This bitfield enable the comparator to compare xcmp with xcnt.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPSHDWUPT</name>
              <description>This bitfield select when the comparator shadow register will be loaded to its work register
00:  after software set shlk bit of shlk register
01:  immediately after the register being modified
10:  after hardware event assert, user can select one of the comparators to generate this hardware event. The comparator can be either output compare mode or input capture mode.
11:  after SHSYNCI assert</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPMODE</name>
              <description>comparator mode
0- output compare mode
1- input capture mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED</name>
              <description>No description avaiable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMPCFG_1</name>
          <description>Comparator configure register</description>
          <addressOffset>0x234</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>XCNTCMPEN</name>
              <description>This bitfield enable the comparator to compare xcmp with xcnt.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPSHDWUPT</name>
              <description>This bitfield select when the comparator shadow register will be loaded to its work register
00:  after software set shlk bit of shlk register
01:  immediately after the register being modified
10:  after hardware event assert, user can select one of the comparators to generate this hardware event. The comparator can be either output compare mode or input capture mode.
11:  after SHSYNCI assert</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPMODE</name>
              <description>comparator mode
0- output compare mode
1- input capture mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED</name>
              <description>No description avaiable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMPCFG_2</name>
          <description>Comparator configure register</description>
          <addressOffset>0x238</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>XCNTCMPEN</name>
              <description>This bitfield enable the comparator to compare xcmp with xcnt.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPSHDWUPT</name>
              <description>This bitfield select when the comparator shadow register will be loaded to its work register
00:  after software set shlk bit of shlk register
01:  immediately after the register being modified
10:  after hardware event assert, user can select one of the comparators to generate this hardware event. The comparator can be either output compare mode or input capture mode.
11:  after SHSYNCI assert</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPMODE</name>
              <description>comparator mode
0- output compare mode
1- input capture mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED</name>
              <description>No description avaiable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMPCFG_3</name>
          <description>Comparator configure register</description>
          <addressOffset>0x23c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>XCNTCMPEN</name>
              <description>This bitfield enable the comparator to compare xcmp with xcnt.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPSHDWUPT</name>
              <description>This bitfield select when the comparator shadow register will be loaded to its work register
00:  after software set shlk bit of shlk register
01:  immediately after the register being modified
10:  after hardware event assert, user can select one of the comparators to generate this hardware event. The comparator can be either output compare mode or input capture mode.
11:  after SHSYNCI assert</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPMODE</name>
              <description>comparator mode
0- output compare mode
1- input capture mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED</name>
              <description>No description avaiable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMPCFG_4</name>
          <description>Comparator configure register</description>
          <addressOffset>0x240</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>XCNTCMPEN</name>
              <description>This bitfield enable the comparator to compare xcmp with xcnt.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPSHDWUPT</name>
              <description>This bitfield select when the comparator shadow register will be loaded to its work register
00:  after software set shlk bit of shlk register
01:  immediately after the register being modified
10:  after hardware event assert, user can select one of the comparators to generate this hardware event. The comparator can be either output compare mode or input capture mode.
11:  after SHSYNCI assert</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPMODE</name>
              <description>comparator mode
0- output compare mode
1- input capture mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED</name>
              <description>No description avaiable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMPCFG_5</name>
          <description>Comparator configure register</description>
          <addressOffset>0x244</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>XCNTCMPEN</name>
              <description>This bitfield enable the comparator to compare xcmp with xcnt.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPSHDWUPT</name>
              <description>This bitfield select when the comparator shadow register will be loaded to its work register
00:  after software set shlk bit of shlk register
01:  immediately after the register being modified
10:  after hardware event assert, user can select one of the comparators to generate this hardware event. The comparator can be either output compare mode or input capture mode.
11:  after SHSYNCI assert</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPMODE</name>
              <description>comparator mode
0- output compare mode
1- input capture mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED</name>
              <description>No description avaiable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMPCFG_6</name>
          <description>Comparator configure register</description>
          <addressOffset>0x248</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>XCNTCMPEN</name>
              <description>This bitfield enable the comparator to compare xcmp with xcnt.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPSHDWUPT</name>
              <description>This bitfield select when the comparator shadow register will be loaded to its work register
00:  after software set shlk bit of shlk register
01:  immediately after the register being modified
10:  after hardware event assert, user can select one of the comparators to generate this hardware event. The comparator can be either output compare mode or input capture mode.
11:  after SHSYNCI assert</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPMODE</name>
              <description>comparator mode
0- output compare mode
1- input capture mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED</name>
              <description>No description avaiable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMPCFG_7</name>
          <description>Comparator configure register</description>
          <addressOffset>0x24c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>XCNTCMPEN</name>
              <description>This bitfield enable the comparator to compare xcmp with xcnt.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPSHDWUPT</name>
              <description>This bitfield select when the comparator shadow register will be loaded to its work register
00:  after software set shlk bit of shlk register
01:  immediately after the register being modified
10:  after hardware event assert, user can select one of the comparators to generate this hardware event. The comparator can be either output compare mode or input capture mode.
11:  after SHSYNCI assert</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPMODE</name>
              <description>comparator mode
0- output compare mode
1- input capture mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED</name>
              <description>No description avaiable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMPCFG_8</name>
          <description>Comparator configure register</description>
          <addressOffset>0x250</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>XCNTCMPEN</name>
              <description>This bitfield enable the comparator to compare xcmp with xcnt.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPSHDWUPT</name>
              <description>This bitfield select when the comparator shadow register will be loaded to its work register
00:  after software set shlk bit of shlk register
01:  immediately after the register being modified
10:  after hardware event assert, user can select one of the comparators to generate this hardware event. The comparator can be either output compare mode or input capture mode.
11:  after SHSYNCI assert</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPMODE</name>
              <description>comparator mode
0- output compare mode
1- input capture mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED</name>
              <description>No description avaiable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMPCFG_9</name>
          <description>Comparator configure register</description>
          <addressOffset>0x254</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>XCNTCMPEN</name>
              <description>This bitfield enable the comparator to compare xcmp with xcnt.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPSHDWUPT</name>
              <description>This bitfield select when the comparator shadow register will be loaded to its work register
00:  after software set shlk bit of shlk register
01:  immediately after the register being modified
10:  after hardware event assert, user can select one of the comparators to generate this hardware event. The comparator can be either output compare mode or input capture mode.
11:  after SHSYNCI assert</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPMODE</name>
              <description>comparator mode
0- output compare mode
1- input capture mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED</name>
              <description>No description avaiable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
