RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6360/HPM6360_svd.xml
        <register>
          <name>TRGOCFG_QEI_B</name>
          <description>Trigger manager output configure register</description>
          <addressOffset>0x19c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000001FF</resetMask>
          <fields>
            <field>
              <name>OUTINV</name>
              <description>1- Invert the output</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FEDG2PEN</name>
              <description>1- The selected input signal falling edge will be convert to an pulse on output.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REDG2PEN</name>
              <description>1- The selected input signal rising edge will be convert to an pulse on output.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIGOSEL</name>
              <description>This bitfield selects one of the TRGM inputs as output.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRGOCFG_QEI_Z</name>
          <description>Trigger manager output configure register</description>
          <addressOffset>0x1a0</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000001FF</resetMask>
          <fields>
            <field>
              <name>OUTINV</name>
              <description>1- Invert the output</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FEDG2PEN</name>
              <description>1- The selected input signal falling edge will be convert to an pulse on output.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REDG2PEN</name>
              <description>1- The selected input signal rising edge will be convert to an pulse on output.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIGOSEL</name>
              <description>This bitfield selects one of the TRGM inputs as output.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRGOCFG_QEI_H</name>
          <description>Trigger manager output configure register</description>
          <addressOffset>0x1a4</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000001FF</resetMask>
          <fields>
            <field>
              <name>OUTINV</name>
              <description>1- Invert the output</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FEDG2PEN</name>
              <description>1- The selected input signal falling edge will be convert to an pulse on output.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REDG2PEN</name>
              <description>1- The selected input signal rising edge will be convert to an pulse on output.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIGOSEL</name>
              <description>This bitfield selects one of the TRGM inputs as output.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRGOCFG_QEI_PAUSE</name>
          <description>Trigger manager output configure register</description>
          <addressOffset>0x1a8</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000001FF</resetMask>
          <fields>
            <field>
              <name>OUTINV</name>
              <description>1- Invert the output</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FEDG2PEN</name>
              <description>1- The selected input signal falling edge will be convert to an pulse on output.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REDG2PEN</name>
              <description>1- The selected input signal rising edge will be convert to an pulse on output.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIGOSEL</name>
              <description>This bitfield selects one of the TRGM inputs as output.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRGOCFG_QEI_SNAPI</name>
          <description>Trigger manager output configure register</description>
          <addressOffset>0x1ac</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000001FF</resetMask>
          <fields>
            <field>
              <name>OUTINV</name>
              <description>1- Invert the output</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FEDG2PEN</name>
              <description>1- The selected input signal falling edge will be convert to an pulse on output.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REDG2PEN</name>
              <description>1- The selected input signal rising edge will be convert to an pulse on output.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIGOSEL</name>
              <description>This bitfield selects one of the TRGM inputs as output.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRGOCFG_HALL_U</name>
          <description>Trigger manager output configure register</description>
          <addressOffset>0x1b0</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000001FF</resetMask>
          <fields>
            <field>
              <name>OUTINV</name>
              <description>1- Invert the output</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FEDG2PEN</name>
              <description>1- The selected input signal falling edge will be convert to an pulse on output.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REDG2PEN</name>
              <description>1- The selected input signal rising edge will be convert to an pulse on output.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIGOSEL</name>
              <description>This bitfield selects one of the TRGM inputs as output.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRGOCFG_HALL_V</name>
          <description>Trigger manager output configure register</description>
          <addressOffset>0x1b4</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000001FF</resetMask>
          <fields>
            <field>
              <name>OUTINV</name>
              <description>1- Invert the output</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FEDG2PEN</name>
              <description>1- The selected input signal falling edge will be convert to an pulse on output.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REDG2PEN</name>
              <description>1- The selected input signal rising edge will be convert to an pulse on output.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIGOSEL</name>
              <description>This bitfield selects one of the TRGM inputs as output.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRGOCFG_HALL_W</name>
          <description>Trigger manager output configure register</description>
          <addressOffset>0x1b8</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000001FF</resetMask>
          <fields>
            <field>
              <name>OUTINV</name>
              <description>1- Invert the output</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FEDG2PEN</name>
              <description>1- The selected input signal falling edge will be convert to an pulse on output.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REDG2PEN</name>
              <description>1- The selected input signal rising edge will be convert to an pulse on output.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIGOSEL</name>
              <description>This bitfield selects one of the TRGM inputs as output.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRGOCFG_HALL_SNAPI</name>
          <description>Trigger manager output configure register</description>
          <addressOffset>0x1bc</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000001FF</resetMask>
          <fields>
            <field>
              <name>OUTINV</name>
              <description>1- Invert the output</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FEDG2PEN</name>
              <description>1- The selected input signal falling edge will be convert to an pulse on output.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REDG2PEN</name>
              <description>1- The selected input signal rising edge will be convert to an pulse on output.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIGOSEL</name>
              <description>This bitfield selects one of the TRGM inputs as output.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRGOCFG_ADC0_STRGI</name>
          <description>Trigger manager output configure register</description>
          <addressOffset>0x1c0</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000001FF</resetMask>
          <fields>
            <field>
              <name>OUTINV</name>
              <description>1- Invert the output</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FEDG2PEN</name>
              <description>1- The selected input signal falling edge will be convert to an pulse on output.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REDG2PEN</name>
              <description>1- The selected input signal rising edge will be convert to an pulse on output.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIGOSEL</name>
              <description>This bitfield selects one of the TRGM inputs as output.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRGOCFG_ADC1_STRGI</name>
          <description>Trigger manager output configure register</description>
          <addressOffset>0x1c4</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000001FF</resetMask>
          <fields>
            <field>
              <name>OUTINV</name>
              <description>1- Invert the output</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FEDG2PEN</name>
              <description>1- The selected input signal falling edge will be convert to an pulse on output.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REDG2PEN</name>
              <description>1- The selected input signal rising edge will be convert to an pulse on output.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIGOSEL</name>
              <description>This bitfield selects one of the TRGM inputs as output.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRGOCFG_ADC2_STRGI</name>
          <description>Trigger manager output configure register</description>
          <addressOffset>0x1c8</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000001FF</resetMask>
          <fields>
            <field>
              <name>OUTINV</name>
              <description>1- Invert the output</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FEDG2PEN</name>
              <description>1- The selected input signal falling edge will be convert to an pulse on output.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REDG2PEN</name>
              <description>1- The selected input signal rising edge will be convert to an pulse on output.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIGOSEL</name>
              <description>This bitfield selects one of the TRGM inputs as output.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRGOCFG_ADC3_STRGI</name>
          <description>Trigger manager output configure register</description>
          <addressOffset>0x1cc</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000001FF</resetMask>
          <fields>
            <field>
              <name>OUTINV</name>
              <description>1- Invert the output</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FEDG2PEN</name>
              <description>1- The selected input signal falling edge will be convert to an pulse on output.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REDG2PEN</name>
              <description>1- The selected input signal rising edge will be convert to an pulse on output.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIGOSEL</name>
              <description>This bitfield selects one of the TRGM inputs as output.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRGOCFG_ADCX_PTRGI0A</name>
          <description>Trigger manager output configure register</description>
          <addressOffset>0x1d0</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000001FF</resetMask>
          <fields>
            <field>
              <name>OUTINV</name>
              <description>1- Invert the output</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FEDG2PEN</name>
              <description>1- The selected input signal falling edge will be convert to an pulse on output.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REDG2PEN</name>
              <description>1- The selected input signal rising edge will be convert to an pulse on output.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIGOSEL</name>
              <description>This bitfield selects one of the TRGM inputs as output.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRGOCFG_ADCX_PTRGI0B</name>
          <description>Trigger manager output configure register</description>
          <addressOffset>0x1d4</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000001FF</resetMask>
          <fields>
            <field>
              <name>OUTINV</name>
              <description>1- Invert the output</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FEDG2PEN</name>
              <description>1- The selected input signal falling edge will be convert to an pulse on output.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REDG2PEN</name>
              <description>1- The selected input signal rising edge will be convert to an pulse on output.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIGOSEL</name>
              <description>This bitfield selects one of the TRGM inputs as output.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
