RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6360/HPM6360_svd.xml
        <register>
          <name>ADMA_ID_ADDR</name>
          <description>No description avaiable</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADMA_ID_ADDR</name>
              <description>ADMA Integrated Descriptor Address
These bits indicate the lower 32-bit of the ADMA Integrated Descriptor address.
The start address of Integrated Descriptor is set to these register bits.
The ADMA3 fetches one Descriptor Address and increments these bits to indicate the next Descriptor address.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P_EMBEDDED_CNTRL</name>
          <description>No description avaiable</description>
          <addressOffset>0xe6</addressOffset>
          <size>16</size>
          <resetValue>0x0000</resetValue>
          <resetMask>0x0FFF</resetMask>
          <fields>
            <field>
              <name>REG_OFFSET_ADDR</name>
              <description>Offset Address of Embedded Control register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P_VENDOR_SPECIFIC_AREA</name>
          <description>No description avaiable</description>
          <addressOffset>0xe8</addressOffset>
          <size>16</size>
          <resetValue>0x0000</resetValue>
          <resetMask>0x0FFF</resetMask>
          <fields>
            <field>
              <name>REG_OFFSET_ADDR</name>
              <description>Base offset Address for Vendor-Specific registers.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P_VENDOR2_SPECIFIC_AREA</name>
          <description>No description avaiable</description>
          <addressOffset>0xea</addressOffset>
          <size>16</size>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>REG_OFFSET_ADDR</name>
              <description>Base offset Address for Command Queuing registers.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SLOT_INTR_STATUS</name>
          <description>No description avaiable</description>
          <addressOffset>0xfc</addressOffset>
          <size>16</size>
          <resetValue>0x0000</resetValue>
          <resetMask>0x00FF</resetMask>
          <fields>
            <field>
              <name>INTR_SLOT</name>
              <description>Interrupt signal for each Slot
These status bits indicate the logical OR of Interrupt signal and Wakeup signal for each slot.
A maximum of 8 slots can be defined. If one interrupt signal is associated with multiple slots, the Host Driver can identify the interrupt that is generated by reading these bits.
 By a power on reset or by setting Software Reset For All bit, the interrupt signals are de-asserted and this status reads 00h.
Bit 00: Slot 1
Bit 01: Slot 2
Bit 02: Slot 3
..........
..........
Bit 07: Slot 8
Note: MSHC Host Controller support single card slot. This register shall always return 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CQVER</name>
          <description>No description avaiable</description>
          <addressOffset>0x180</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000FFF</resetMask>
          <fields>
            <field>
              <name>EMMC_VER_MAHOR</name>
              <description>This bit indicates the eMMC major version (1st digit left of decimal point) in BCD format.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EMMC_VER_MINOR</name>
              <description>This bit indicates the eMMC minor version (1st digit right of decimal point) in BCD format.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EMMC_VER_SUFFIX</name>
              <description>This bit indicates the eMMC version suffix (2nd digit right of decimal point) in BCD format.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CQCAP</name>
          <description>No description avaiable</description>
          <addressOffset>0x184</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x1000F3FF</resetMask>
          <fields>
            <field>
              <name>CRYPTO_SUPPORT</name>
              <description>Crypto Support
This bit indicates whether the Host Controller supports cryptographic operations.
Values:
0x0 (FALSE): Crypto not Supported
0x1 (TRUE): Crypto Supported</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ITCFMUL</name>
              <description>Internal Timer Clock Frequency Multiplier (ITCFMUL)
This field indicates the frequency of the clock used for interrupt coalescing timer and for determining the SQS
polling period. See ITCFVAL definition for details. Values 0x5 to 0xF are reserved.
Values:
0x0 (CLK_1KHz): 1KHz clock
0x1 (CLK_10KHz): 10KHz clock
0x2 (CLK_100KHz): 100KHz clock
0x3 (CLK_1MHz): 1MHz clock
0x4 (CLK_10MHz): 10MHz clock</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ITCFVAL</name>
              <description>Internal Timer Clock Frequency Value (ITCFVAL)
This field scales the frequency of the timer clock provided by ITCFMUL. The Final clock frequency of actual timer clock is calculated as ITCFVAL* ITCFMUL.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CQCFG</name>
          <description>No description avaiable</description>
          <addressOffset>0x188</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00001101</resetMask>
          <fields>
            <field>
              <name>DCMD_EN</name>
              <description>This bit indicates to the hardware whether the Task
Descriptor in slot #31 of the TDL is a data transfer descriptor or a direct-command descriptor. CQE uses this bit when a task is issued in slot #31, to determine how to decode the Task Descriptor.
Values:
0x1 (SLOT31_DCMD_ENABLE): Task descriptor in slot #31 is a DCMD Task Descriptor
0x0 (SLOT31_DCMD_DISABLE): Task descriptor in slot #31 is a data Transfer Task Descriptor</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_DESC_SIZE</name>
              <description>Bit Value Description
This bit indicates the size of task descriptor used in host memory. This bit can only be configured when Command Queuing Enable bit is 0 (command queuing is disabled).
Values:
0x1 (TASK_DESC_128b): Task descriptor size is 128 bits
0x0 (TASK_DESC_64b): Task descriptor size is 64 bit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CQ_EN</name>
              <description>No description avaiable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CQCTL</name>
          <description>No description avaiable</description>
          <addressOffset>0x18c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000101</resetMask>
          <fields>
            <field>
              <name>CLR_ALL_TASKS</name>
              <description>Clear all tasks
This bit can only be written when the controller is halted. This bit does not clear tasks in the device. The software has to use the CMDQ_TASK_MGMT command to clear device's queue.
Values:
0x1 (CLEAR_ALL_TASKS): Clears all the tasks in the controller
0x0 (NO_EFFECT): Programming 0 has no effect</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HALT</name>
              <description>Halt request and resume
Values:
0x1 (HALT_CQE): Software writes 1 to this bit when it wants to acquire software control over the eMMC bus and to disable CQE from issuing command on the bus.
For example, issuing a Discard Task command (CMDQ_TASK_MGMT).
When the software writes 1, CQE completes the ongoing task (if any in progress).
After the task is completed and the CQE is in idle state, CQE does not issue new commands and indicates to the software by setting this bit to 1.
The software can poll on this bit until it is set to 1 and only then send  commands on the eMMC bus.
0x0 (RESUME_CQE): Software writes 0 to this bit to exit from the halt state and resume CQE activity</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CQIS</name>
          <description>No description avaiable</description>
          <addressOffset>0x190</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>TCL</name>
              <description>Task cleared interrupt
This status bit is asserted (if CQISE.TCL_STE=1) when a task clear operation is completed by CQE.
The completed task clear operation is either an individual task clear (by writing CQTCLR) or clearing of all tasks (by writing CQCTL).
A value of 1 clears this status bit.
Values:
0x1 (SET): TCL Interrupt is set
0x0 (NOTSET): TCL Interrupt is not set</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RED</name>
              <description>Response error detected interrupt
This status bit is asserted (if CQISE.RED_STE=1) when a response is received with an error bit set in the device status
field. Configure the CQRMEM register to identify device status bit fields that may trigger an interrupt and that are masked.
A value of 1 clears this status bit.
Values:
0x1 (SET): RED Interrupt is set
0x0 (NOTSET): RED Interrupt is not set</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TCC</name>
              <description>Task complete interrupt
This status bit is asserted (if CQISE.TCC_STE=1) when at least one of the following conditions are met:
A task is completed and the INT bit is set in its Task Descriptor
Interrupt caused by Interrupt Coalescing logic due to timeout
Interrupt Coalescing logic reached the configured threshold
A value of 1 clears this status bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HAC</name>
              <description>Halt complete interrupt
This status bit is asserted (only if CQISE.HAC_STE=1) when halt bit in the CQCTL register transitions from 0 to 1 indicating that  the host controller has completed its current ongoing task and has entered halt state.
A value of 1 clears this status bit.
Values:
0x1 (SET): HAC Interrupt is set
0x0 (NOTSET): HAC Interrupt is not set</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CQISE</name>
          <description>No description avaiable</description>
          <addressOffset>0x194</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>TCL_STE</name>
              <description>Task cleared interrupt status enable
Values:
0x1 (INT_STS_ENABLE): CQIS.TCL is set when its interrupt condition is active
0x0 (INT_STS_DISABLE): CQIS.TCL is disabled</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RED_STE</name>
              <description>Response error detected interrupt status enable
Values:
0x1 (INT_STS_ENABLE): CQIS.RED is set when its interrupt condition is active
0x0 (INT_STS_DISABLE): CQIS.RED is disabled</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TCC_STE</name>
              <description>Task complete interrupt status enable
Values:
0x1 (INT_STS_ENABLE): CQIS.TCC is set when its interrupt condition is active
0x0 (INT_STS_DISABLE): CQIS.TCC is disabled</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HAC_STE</name>
              <description>Halt complete interrupt status enable
Values:
0x1 (INT_STS_ENABLE): CQIS.HAC is set when its interrupt condition is active
0x0 (INT_STS_DISABLE): CQIS.HAC is disabled</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CQISGE</name>
          <description>No description avaiable</description>
          <addressOffset>0x198</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>TCL_SGE</name>
              <description>Task cleared interrupt signal enable
Values:
0x1 (INT_SIG_ENABLE): CQIS.TCL interrupt signal generation is active
0x0 (INT_SIG_DISABLE): CQIS.TCL interrupt signal generation is disabled</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RED_SGE</name>
              <description>Response error detected interrupt signal enable
Values:
0x1 (INT_SIG_ENABLE): CQIS.RED interrupt signal generation is active
0x0 (INT_SIG_DISABLE): CQIS.RED interrupt signal generation is disabled</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TCC_SGE</name>
              <description>Task complete interrupt signal enable
Values:
0x1 (INT_SIG_ENABLE): CQIS.TCC interrupt signal generation is active
0x0 (INT_SIG_DISABLE): CQIS.TCC interrupt signal generation is disabled</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HAC_SGE</name>
              <description>Halt complete interrupt signal enable
Values:
0x1 (INT_SIG_ENABLE): CQIS.HAC interrupt signal generation is active
0x0 (INT_SIG_DISABLE): CQIS.HAC interrupt signal generation is disabled</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CQIC</name>
          <description>No description avaiable</description>
          <addressOffset>0x19c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x80119FFF</resetMask>
          <fields>
            <field>
              <name>INTC_EN</name>
              <description>Interrupt Coalescing Enable Bit
Values:
0x1 (ENABLE_INT_COALESCING): Interrupt coalescing mechanism is active. Interrupts are counted and timed, and coalesced interrupts are generated
0x0 (DISABLE_INT_COALESCING): Interrupt coalescing mechanism is disabled (Default)</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTC_STAT</name>
              <description>Interrupt Coalescing Status Bit
This bit indicates to the software whether any tasks (with INT=0) have completed and counted towards interrupt
coalescing (that is, this is set if and only if INTC counter &gt; 0).
Values:
0x1 (INTC_ATLEAST1_COMP): At least one INT0 task completion has been counted (INTC counter &gt; 0)
0x0 (INTC_NO_TASK_COMP): INT0 Task completions have not occurred since last counter reset (INTC counter == 0)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INTC_RST</name>
              <description>Counter and Timer Reset
When host driver writes 1, the interrupt coalescing timer and counter are reset.
Values:
0x1 (ASSERT_INTC_RESET): Interrupt coalescing timer and counter are reset
0x0 (NO_EFFECT): No Effect</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>INTC_TH_WEN</name>
              <description>Interrupt Coalescing Counter Threshold Write Enable
When software writes 1 to this bit, the value INTC_TH is updated with the contents written on the same cycle.
Values:
0x1 (WEN_SET): Sets INTC_TH_WEN
0x0 (WEN_CLR): Clears INTC_TH_WEN</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>INTC_TH</name>
              <description>Interrupt Coalescing Counter Threshold filed
Software uses this field to configure the number of task completions (only tasks with INT=0 in the Task Descriptor), which are required in order to generate an interrupt.
Counter Operation: As data transfer tasks with INT=0 complete, they are counted by CQE.
The counter is reset by software during the interrupt service routine.
The counter stops counting when it reaches the value configured in INTC_TH, and generates interrupt.
0x0: Interrupt coalescing feature disabled
0x1: Interrupt coalescing interrupt generated after 1 task when INT=0 completes
0x2: Interrupt coalescing interrupt generated after 2 tasks when INT=0 completes
........
0x1f: Interrupt coalescing interrupt generated after 31 tasks when INT=0 completes
To write to this field, the INTC_TH_WEN bit must be set during the same write operation.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TOUT_VAL_WEN</name>
              <description>When software writes 1 to this bit, the value TOUT_VAL is updated with the contents written on the same cycle.
Values:
0x1 (WEN_SET): Sets TOUT_VAL_WEN
0x0 (WEN_CLR): clears TOUT_VAL_WEN</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TOUT_VAL</name>
              <description>Interrupt Coalescing Timeout Value
Software uses this field to configure the maximum time allowed between the completion of a task on the bus and the generation of an interrupt.
Timer Operation: The timer is reset by software during the interrupt service routine.
It starts running when the first data transfer task with INT=0 is completed, after the timer was reset.
When the timer reaches the value configured in ICTOVAL field, it  generates an interrupt and stops.
The timer's unit is equal to 1024 clock periods of the clock whose frequency is specified in the Internal Timer Clock Frequency field CQCAP register.
0x0: Timer is disabled. Timeout-based interrupt is not generated
0x1: Timeout on 01x1024 cycles of timer clock frequency
0x2: Timeout on 02x1024 cycles of timer clock frequency
........
0x7f: Timeout on 127x1024 cycles of timer clock frequency
In order to write to this field, the TOUT_VAL_WEN bit must
be set at the same write operation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CQTDLBA</name>
          <description>No description avaiable</description>
          <addressOffset>0x1a0</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TDLBA</name>
              <description>This register stores the LSB bits (31:0) of the byte address of the head of the Task Descriptor List in system memory.
The size of the task descriptor list is 32 * (Task Descriptor size + Transfer Descriptor size) as configured by the host driver.
This address is set on 1 KB boundary. The lower 10 bits of this register are set to 0 by the software and are ignored by CQE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
