RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6360/HPM6360_svd.xml
        <register>
          <name>CQTDBR</name>
          <description>No description avaiable</description>
          <addressOffset>0x1a8</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DBR</name>
              <description>The software configures TDLBA and TDLBAU, and enable
CQE in CQCFG before using this register.
Writing 1 to bit n of this register triggers CQE to start processing the task encoded in slot n of the TDL.
Writing 0 by the software does not have any impact on the hardware, and does not change the value of the register bit.
CQE always processes tasks according to the order submitted to the list by CQTDBR write transactions.
CQE processes Data Transfer tasks by reading the Task Descriptor and sending QUEUED_TASK_PARAMS (CMD44) and QUEUED_TASK_ADDRESS (CMD45) commands to
the device. CQE processes DCMD tasks (in slot #31, when enabled) by reading the Task Descriptor, and generating the command encoded by its index and argument.
The corresponding bit is cleared to 0 by CQE in one of the following events:
A task execution is completed (with success or error).
The task is cleared using CQTCLR register.
All tasks are cleared using CQCTL register.
CQE is disabled using CQCFG register.
Software may initiate multiple tasks at the same time (batch submission) by writing 1 to multiple bits of this register in the same transaction.
In the case of batch submission, CQE processes the tasks in order of the task index, starting with the lowest index.
If one or more tasks in the batch are marked with QBR, the ordering of execution is based on said processing order.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CQTCN</name>
          <description>No description avaiable</description>
          <addressOffset>0x1ac</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TCN</name>
              <description>Task Completion Notification
Each of the 32 bits are bit mapped to the 32 tasks.
Bit-N(1): Task-N has completed execution (with success or errors)
Bit-N(0): Task-N has not completed, could be pending or not submitted.
On task completion, software may read this register to know tasks that have completed. After reading this register,
software may clear the relevant bit fields by writing 1 to the corresponding bits.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CQDQS</name>
          <description>No description avaiable</description>
          <addressOffset>0x1b0</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DQS</name>
              <description>Device Queue Status
Each of the 32 bits are bit mapped to the 32 tasks.
Bit-N(1): Device has marked task N as ready for execution
Bit-N(0): Task-N is not ready for execution. This task could be pending in device or not submitted.
Host controller updates this register with response of the Device Queue Status command.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CQDPT</name>
          <description>No description avaiable</description>
          <addressOffset>0x1b4</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DPT</name>
              <description>Device-Pending Tasks
Each of the 32 bits are bit mapped to the 32 tasks.
Bit-N(1): Task-N has been successfully queued into the device and is awaiting execution
Bit-N(0): Task-N is not yet queued.
Bit n of this register is set if and only if QUEUED_TASK_PARAMS (CMD44) and QUEUED_TASK_ADDRESS (CMD45) were sent for this specific task and if this task has not been executed.
The controller sets this bit after receiving a successful response for CMD45. CQE clears this bit after the task has completed execution.
Software reads this register in the task-discard procedure to determine if the task is queued in the device</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CQTCLR</name>
          <description>No description avaiable</description>
          <addressOffset>0x1b8</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TCLR</name>
              <description>Writing 1 to bit n of this register orders CQE to clear a task that the software has previously issued.
This bit can only be written when CQE is in Halt state as indicated in CQCFG register Halt bit.
When software writes 1 to a bit in this register, CQE updates the value to 1, and starts clearing the data structures related to the task.
CQE clears the bit fields (sets a value of 0) in CQTCLR and in CQTDBR once the clear operation is complete.
Software must poll on the CQTCLR until it is  leared to verify that a clear operation was done.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CQSSC1</name>
          <description>No description avaiable</description>
          <addressOffset>0x1c0</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000FFFFF</resetMask>
          <fields>
            <field>
              <name>SQSCMD_BLK_CNT</name>
              <description>This field indicates when SQS CMD is sent while data transfer is in progress.
A value of 'n' indicates that CQE sends status command on the CMD line, during the transfer of data block BLOCK_CNTn, on the data lines, where BLOCK_CNT is the number of blocks in the current transaction.
0x0: SEND_QUEUE_STATUS (CMD13) command is not sent during the transaction. Instead, it is sent only when the data lines are idle.
0x1: SEND_QUEUE_STATUS command is to be sent during the last block of the transaction.
0x2: SEND_QUEUE_STATUS command when last 2 blocks are pending.
0x3: SEND_QUEUE_STATUS command when last 3 blocks are pending.
........
0xf: SEND_QUEUE_STATUS command when last 15 blocks are pending.
Should be programmed only when CQCFG.CQ_EN is 0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SQSCMD_IDLE_TMR</name>
              <description>This field configures the polling period to be used when using periodic SEND_QUEUE_STATUS (CMD13) polling.
Periodic polling is used when tasks are pending in the device, but no data transfer is in progress.
When a SEND_QUEUE_STATUS response indicates that no task is ready for execution, CQE counts the configured time until it issues the next SEND_QUEUE_STATUS.
Timer units are clock periods of the clock whose frequency is specified in the Internal Timer Clock Frequency field CQCAP register.
The minimum value is 0001h (1 clock period) and the maximum value is FFFFh (65535 clock periods).
For example, a CQCAP field value of 0 indicates a 19.2 MHz clock frequency (period = 52.08 ns).
If the setting in CQSSC1.CIT is 1000h, the calculated polling period is 4096*52.08 ns= 213.33 us.
Should be programmed only when CQCFG.CQ_EN is '0'</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CQSSC2</name>
          <description>No description avaiable</description>
          <addressOffset>0x1c4</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>SQSCMD_RCA</name>
              <description>This field provides CQE with the contents of the 16-bit RCA field in SEND_QUEUE_STATUS (CMD13) command argument.
CQE copies this field to bits 31:16 of the argument when transmitting SEND_ QUEUE_STATUS (CMD13) command.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CQCRDCT</name>
          <description>No description avaiable</description>
          <addressOffset>0x1c8</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCMD_RESP</name>
              <description>This register contains the response of the command generated by the last direct command (DCMD) task that was sent.
Contents of this register are valid only after bit 31 of CQTDBR register is cleared by the controller.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CQRMEM</name>
          <description>No description avaiable</description>
          <addressOffset>0x1d0</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RESP_ERR_MASK</name>
              <description>The bits of this field are bit mapped to the device response.
This bit is used as an interrupt mask on the device status filed that is received in R1/R1b responses.
1: When a R1/R1b response is received, with a bit i in the device status set, a RED interrupt is generated.
0: When a R1/R1b response is received, bit i in the device status is ignored.
The reset value of this register is set to trigger an interrupt on all "Error" type bits in the device status.
Note: Responses to CMD13 (SQS) encode the QSR so that they are ignored by this logic.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CQTERRI</name>
          <description>No description avaiable</description>
          <addressOffset>0x1d4</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x1F3F9F3F</resetMask>
          <fields>
            <field>
              <name>TRANS_ERR_TASKID</name>
              <description>This field captures the ID of the task that was executed and whose data transfer has errors.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TRANS_ERR_CMD_INDX</name>
              <description>This field captures the index of the command that was executed and whose data transfer has errors.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RESP_ERR_FIELDS_VALID</name>
              <description>This bit is updated when an error is detected while a command transaction was in progress.
Values:
0x1 (SET): Response-related error is detected. Check contents of RESP_ERR_TASKID and RESP_ERR_CMD_INDX fields
0x0 (NOT_SET): Ignore contents of RESP_ERR_TASKID and RESP_ERR_CMD_INDX</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RESP_ERR_TASKID</name>
              <description>This field captures the ID of the task which was executed on the command line when the error occurred.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RESP_ERR_CMD_INDX</name>
              <description>This field captures the index of the command that was executed on the command line when the error occurred</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CQCRI</name>
          <description>No description avaiable</description>
          <addressOffset>0x1d8</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000003F</resetMask>
          <fields>
            <field>
              <name>CMD_RESP_INDX</name>
              <description>Last Command Response index
This field stores the index of the last received command response. Controller updates the value every time a command response is received</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CQCRA</name>
          <description>No description avaiable</description>
          <addressOffset>0x1dc</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CMD_RESP_ARG</name>
              <description>Last Command Response argument
This field stores the argument of the last received command response. Controller updates the value every time a command response is received.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MSHC_VER_ID</name>
          <description>No description avaiable</description>
          <addressOffset>0x500</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VER_ID</name>
              <description>No description avaiable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MSHC_VER_TYPE</name>
          <description>No description avaiable</description>
          <addressOffset>0x504</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VER_TYPE</name>
              <description>No description avaiable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MBIU_CTRL</name>
          <description>Y</description>
          <addressOffset>0x510</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>BURST_INCR16_EN</name>
              <description>No description avaiable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BURST_INCR8_EN</name>
              <description>No description avaiable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUSRT_INCR4_EN</name>
              <description>No description avaiable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UNDEFL_INCR_EN</name>
              <description>No description avaiable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EMMC_BOOT_CTRL</name>
          <description>No description avaiable</description>
          <addressOffset>0x52c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xF181070F</resetMask>
          <fields>
            <field>
              <name>BOOT_TOUT_CNT</name>
              <description>Boot Ack Timeout Counter Value.
This value determines the interval by which boot ack timeout (50 ms) is detected when boot ack is expected during boot operation.
0xF : Reserved
0xE : TMCLK x 2^27
 ............
0x1 : TMCLK x 2^14
0x0 : TMCLK x 2^13</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BOOT_ACK_ENABLE</name>
              <description>Boot Acknowledge Enable
When this bit set, SDXC checks for boot acknowledge start pattern of 0-1-0 during boot operation. This bit is applicable for both mandatory and alternate boot mode.
Values:
0x1 (TRUE): Boot Ack enable
0x0 (FALSE): Boot Ack disable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VALIDATE_BOOT</name>
              <description>Validate Mandatory Boot Enable bit
This bit is used to validate the MAN_BOOT_EN bit.
Values:
0x1 (TRUE): Validate Mandatory boot enable bit
0x0 (FALSE): Ignore Mandatory boot Enable bit</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MAN_BOOT_EN</name>
              <description>Mandatory Boot Enable
This bit is used to initiate the mandatory boot operation. The application sets this bit along with VALIDATE_BOOT bit.
Writing 0 is ignored. The SDXC clears this bit after the boot transfer is completed or terminated.
Values:
0x1 (MAN_BOOT_EN): Mandatory boot enable
0x0 (MAN_BOOT_DIS): Mandatory boot disable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CQE_PREFETCH_DISABLE</name>
              <description>Enable or Disable CQE's PREFETCH feature
This field allows Software to disable CQE's data prefetch feature when set to 1.
Values:
0x0 (PREFETCH_ENABLE): CQE can Prefetch data for sucessive WRITE transfers and pipeline sucessive READ transfers
0x1 (PREFETCH_DISABLE): Prefetch for WRITE and Pipeline for READ are disabled</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CQE_ALGO_SEL</name>
              <description>Scheduler algorithm selected for execution
This bit selects the Algorithm used for selecting one of the many ready tasks for execution.
Values:
0x0 (PRI_REORDER_PLUS_FCFS): Priority based reordering with FCFS to resolve equal priority tasks
0x1 (FCFS_ONLY): First come First serve, in the order of DBR rings</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENH_STROBE_ENABLE</name>
              <description>Enhanced Strobe Enable
This bit instructs SDXC to sample the CMD line using data strobe for HS400 mode.
Values:
0x1 (ENH_STB_FOR_CMD): CMD line is sampled using data strobe for HS400 mode
0x0 (NO_STB_FOR_CMD): CMD line is sampled using cclk_rx for HS400 mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EMMC_RST_N_OE</name>
              <description>Output Enable control for EMMC Device Reset signal PAD
control.
This field drived sd_rst_n_oe output of SDXC
Values:
0x1 (ENABLE): sd_rst_n_oe is 1
0x0 (DISABLE): sd_rst_n_oe is 0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EMMC_RST_N</name>
              <description>EMMC Device Reset signal control.
This register field controls the sd_rst_n output of SDXC
Values:
0x1 (RST_DEASSERT): Reset to eMMC device is deasserted
0x0 (RST_ASSERT): Reset to eMMC device asserted (active low)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DISABLE_DATA_CRC_CHK</name>
              <description>Disable Data CRC Check
This bit controls masking of CRC16 error for Card Write in eMMC mode.
This is useful in bus testing (CMD19) for an eMMC device. In bus testing, an eMMC card does not send CRC status for a block,
which may generate CRC error. This CRC error can be masked using this bit during bus testing.
Values:
0x1 (DISABLE): DATA CRC check is disabled
0x0 (ENABLE): DATA CRC check is enabled</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CARD_IS_EMMC</name>
              <description>eMMC Card present
This bit indicates the type of card connected. An application program this bit based on the card connected to SDXC.
Values:
0x1 (EMMC_CARD): Card connected to SDXC is an eMMC card
0x0 (NON_EMMC_CARD): Card connected to SDXCis a non-eMMC card</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
