RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6360/HPM6360_svd.xml
        <register>
          <name>DATSZ</name>
          <description>IP Command Control Register 1</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <fields>
            <field>
              <name>DATSZ</name>
              <description>Data Size in Byte
When IP command is not a write/read operation, DATSZ field would be ignored.
000b - 4
001b - 1
010b - 2
011b - 3
100b - 4
101b - 4
110b - 4
111b - 4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BYTEMSK</name>
          <description>IP Command Control Register 2</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>BM3</name>
              <description>Byte Mask for Byte 3 (IPTXD bit 31:24)
0b - Byte Unmasked
1b - Byte Masked</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BM2</name>
              <description>Byte Mask for Byte 2 (IPTXD bit 23:16)
0b - Byte Unmasked
1b - Byte Masked</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BM1</name>
              <description>Byte Mask for Byte 1 (IPTXD bit 15:8)
0b - Byte Unmasked
1b - Byte Masked</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BM0</name>
              <description>Byte Mask for Byte 0 (IPTXD bit 7:0)
0b - Byte Unmasked
1b - Byte Masked</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IPCMD</name>
          <description>IP Command Register</description>
          <addressOffset>0x9c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>KEY</name>
              <description>This field should be written with 0x5AA5 when trigging an IP command for all device types. The memory
device is selected by BRx settings and IPCR0 registers.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CMD</name>
              <description>SDRAM Commands:
• 0x8: READ
• 0x9: WRITE
• 0xA: MODESET
• 0xB: ACTIVE
• 0xC: AUTO REFRESH
• 0xD: SELF REFRESH
• 0xE: PRECHARGE
• 0xF: PRECHARGE ALL
• Others: RSVD
NOTE: SELF REFRESH is sent to all SDRAM devices because they shared same CLK pin.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IPTX</name>
          <description>TX DATA Register</description>
          <addressOffset>0xa0</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAT</name>
              <description>Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IPRX</name>
          <description>RX DATA Register</description>
          <addressOffset>0xb0</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAT</name>
              <description>Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STAT0</name>
          <description>Status Register 0</description>
          <addressOffset>0xc0</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>IDLE</name>
              <description>Indicating whether it is in IDLE state.
When IDLE=1, it is in IDLE state. There is no pending AXI command in internal queue and no
pending device access.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DLYCFG</name>
          <description>Delay Line Config Register</description>
          <addressOffset>0x150</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000203F</resetMask>
          <fields>
            <field>
              <name>OE</name>
              <description>delay clock output enable, should be set after setting DLYEN and DLYSEL</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DLYSEL</name>
              <description>delay line select, 0 for 1 cell, 31 for all 32 cells</description>
              <bitOffset>1</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DLYEN</name>
              <description>delay line enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
